---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageAccessor.GetDescriptionText
source: html/326be26e-4bdc-4338-20a3-c87b3827143f.htm
---
# Autodesk.Revit.DB.FailureMessageAccessor.GetDescriptionText Method

Retrieves the description of the failure.

## Syntax (C#)
```csharp
public string GetDescriptionText()
```

## Returns
The description text.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This FailureMessageAccessor has not been properly initialized.